IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/TPTC00_TPTC00.xml
	<register id="TPTC00_ERRDET" acronym="TPTC00_ERRDET" offset="0x12C" width="24" description="">
		<bitfield id="TCCHEN" width="1" begin="17" end="17" resetval="0x0" description="Contains the OPT.TCCHEN value programmed by the user for the Read or Write transaction that resulted in an error." range="17" rwaccess="RO"/> 
		<bitfield id="TCINTEN" width="1" begin="16" end="16" resetval="0x0" description="Contains the OPT.TCINTEN value programmed by the user for the Read or Write transaction that resulted in an error." range="16" rwaccess="RO"/> 
		<bitfield id="TCC" width="6" begin="13" end="8" resetval="0x0" description="Transfer Complete Code: Contains the OPT.TCC value programmed by the user for the Read or Write transaction that resulted in an error." range="13 - 8" rwaccess="RO"/> 
		<bitfield id="STAT" width="4" begin="3" end="0" resetval="0x0" description="Transaction Status:Stores the non-zero status/error code that was detected on the read status or write status bus.MS-bit effectively serves as the read vs. write error code.If read status and write status are returned on the same cycle then the TC chooses non-zero version. If both are non-zero then write status is treated as higher priority.Encoding of errors matches the CBA spec." range="3 - 0" rwaccess="RO"/>
	</register>
	<register id="TPTC00_ERRCMD" acronym="TPTC00_ERRCMD" offset="0x130" width="8" description="">
		<bitfield id="SET" width="1" begin="1" end="1" resetval="0x0" description="Set TPTC error interrupt:Write of '1' to SET causes TPTC error interrupt to be pulsed unconditionally.Writes of '0' have no affect." range="1" rwaccess="WO"/> 
		<bitfield id="EVAL" width="1" begin="0" end="0" resetval="0x0" description="Evaluate state of TPTC error interruptWrite of '1' to EVAL causes TPTC error interrupt to be pulsed if any of the ERRSTAT bits are set to '1'.Writes of '0' have no affect." range="0" rwaccess="WO"/>
	</register>
	<register id="TPTC00_RDRATE" acronym="TPTC00_RDRATE" offset="0x140" width="8" description="">
		<bitfield id="RDRATE" width="3" begin="2" end="0" resetval="0x0" description="Read Rate Control: Controls the number of cycles between read commands. This is a global setting that applies to all TRs for this TC." range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TPTC00_POPT" acronym="TPTC00_POPT" offset="0x200" width="32" description="">
		<bitfield id="DBG_ID" width="2" begin="29" end="28" resetval="0x0" description="Debug IDValue driven on the read (tptc_r_dbg_channel_id) and write (tptc_w_dbg_channel_id) command bus.Used at system level for trace/profiling of user selected transfers in systems that include this feature." range="29 - 28" rwaccess="RW"/> 
		<bitfield id="TCCHEN" width="1" begin="22" end="22" resetval="0x0" description="Transfer complete chaining enable:0: Transfer complete chaining is disabled.1: Transfer complete chaining is enabled." range="22" rwaccess="RW"/> 
		<bitfield id="TCINTEN" width="1" begin="20" end="20" resetval="0x0" description="Transfer complete interrupt enable:0: Transfer complete interrupt is disabled.1: Transfer complete interrupt is enabled." range="20" rwaccess="RW"/> 
		<bitfield id="TCC" width="6" begin="17" end="12" resetval="0x0" description="Transfer Complete Code: The 6-bit code is used to set the relevant bit in CER or IPR of the TPCC module." range="17 - 12" rwaccess="RW"/> 
		<bitfield id="FWID" width="3" begin="10" end="8" resetval="0x0" description="FIFO width control: Applies if either SAM or DAM is set to FIFO mode." range="10 - 8" rwaccess="RW"/> 
		<bitfield id="PRI" width="3" begin="6" end="4" resetval="0x0" description="Transfer Priority:0: Priority 0 - Highest priority1: Priority 1 ...7: Priority 7 - Lowest priority" range="6 - 4" rwaccess="RW"/> 
		<bitfield id="DAM" width="1" begin="1" end="1" resetval="0x0" description="Destination Address Mode within an array:0: INCR Dst addressing within an array increments.1: FIFO Dst addressing within an array wraps around upon reaching FIFO width." range="1" rwaccess="RW"/> 
		<bitfield id="SAM" width="1" begin="0" end="0" resetval="0x0" description="Source Address Mode within an array:0: INCR Src addressing within an array increments.1: FIFO Src addressing within an array wraps around upon reaching FIFO width." range="0" rwaccess="RW"/>
	</register>
	<register id="TPTC00_PSRC" acronym="TPTC00_PSRC" offset="0x204" width="32" description="">
		<bitfield id="SADDR" width="32" begin="31" end="0" resetval="0x0" description="Source address for Program Register Set" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="TPTC00_PCNT" acronym="TPTC00_PCNT" offset="0x208" width="32" description="">
		<bitfield id="BCNT" width="16" begin="31" end="16" resetval="0x0" description="B-Dimension count. Number of arrays to be transferred where each array is ACNT in length." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="ACNT" width="16" begin="15" end="0" resetval="0x0" description="A-Dimension count. Number of bytes to be transferred in first dimension." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="TPTC00_PDST" acronym="TPTC00_PDST" offset="0x20C" width="32" description="">
		<bitfield id="DADDR" width="32" begin="31" end="0" resetval="0x0" description="Destination address for Program Register Set" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="TPTC00_PBIDX" acronym="TPTC00_PBIDX" offset="0x210" width="32" description="">
		<bitfield id="DBIDX" width="16" begin="31" end="16" resetval="0x0" description="Dest B-Idx for Program Register Set:B-Idx offset between Destination arrays: Represents the offset in bytes between the starting address of each destination array [recall that there are BCNT arrays of ACNT elements]. DBIDX is always used regardless of whether DAM is Increment or FIFO mode." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="SBIDX" width="16" begin="15" end="0" resetval="0x0" description="Source B-Idx for Program Register Set:B-Idx offset between Source arrays: Represents the offset in bytes between the starting address of each source array [recall that there are BCNT arrays of ACNT elements]. SBIDX is always used regardless of whether SAM is Increment or FIFO mode." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="TPTC00_PMPPRXY" acronym="TPTC00_PMPPRXY" offset="0x214" width="16" description="">
		<bitfield id="SECURE" width="1" begin="9" end="9" resetval="0x0" description="Secure Level: Deprecated, always read as 0." range="9" rwaccess="RO"/> 
		<bitfield id="PRIV" width="1" begin="8" end="8" resetval="0x0" description="Privilege Level:PRIV = 0 : User level privilegePRIV = 1 : Supervisor level privilegePMPPRXY.PRIV is always updated with the value from the configuration bus privilege field on any/every write to Program Set BIDX Register [trigger register].The PRIV value for the SA Set and DF Set are copied from the value in the Program set along with the remainder of the parameter values.The privilege ID is issued on the VBusM read and write command bus such that the target endpoints can perform memory protection checks based on the PRIV of the external host that sets up the DMA transaction." range="8" rwaccess="RO"/> 
		<bitfield id="PRIVID" width="4" begin="3" end="0" resetval="0x0" description="Privilege ID:PMPPRXY.PRIVID is always updated with the value from configuration bus privilege ID field on any/every write to Program Set BIDX Register [trigger register].The PRIVID value for the SA Set and DF Set are copied from the value in the Program set along with the remainder of the parameter values.The privilege ID is issued on the VBusM read and write command bus such that the target endpoints can perform memory protection checks based on the privid of the external host that sets up the DMA transaction." range="3 - 0" rwaccess="RO"/>
	</register>
	<register id="TPTC00_SAOPT" acronym="TPTC00_SAOPT" offset="0x240" width="32" description="">
		<bitfield id="DBG_ID" width="2" begin="29" end="28" resetval="0x0" description="Debug IDValue driven on the read (tptc_r_dbg_channel_id) and write (tptc_w_dbg_channel_id) command bus.Used at system level for trace/profiling of user selected transfers in systems that include this feature." range="29 - 28" rwaccess="RW"/> 
		<bitfield id="TCCHEN" width="1" begin="22" end="22" resetval="0x0" description="Transfer complete chaining enable:0: Transfer complete chaining is disabled.1: Transfer complete chaining is enabled." range="22" rwaccess="RW"/> 
		<bitfield id="TCINTEN" width="1" begin="20" end="20" resetval="0x0" description="Transfer complete interrupt enable:0: Transfer complete interrupt is disabled.1: Transfer complete interrupt is enabled." range="20" rwaccess="RW"/> 
		<bitfield id="TCC" width="6" begin="17" end="12" resetval="0x0" description="Transfer Complete Code: The 6-bit code is used to set the relevant bit in CER or IPR of the TPCC module." range="17 - 12" rwaccess="RW"/> 
		<bitfield id="FWID" width="3" begin="10" end="8" resetval="0x0" description="FIFO width control: Applies if either SAM or DAM is set to FIFO mode." range="10 - 8" rwaccess="RW"/> 
		<bitfield id="PRI" width="3" begin="6" end="4" resetval="0x0" description="Transfer Priority:0: Priority 0 - Highest priority1: Priority 1 ...7: Priority 7 - Lowest priority" range="6 - 4" rwaccess="RW"/> 
		<bitfield id="DAM" width="1" begin="1" end="1" resetval="0x0" description="Destination Address Mode within an array:0: INCR Dst addressing within an array increments.1: FIFO Dst addressing within an array wraps around upon reaching FIFO width." range="1" rwaccess="RW"/> 
		<bitfield id="SAM" width="1" begin="0" end="0" resetval="0x0" description="Source Address Mode within an array:0: INCR Src addressing within an array increments.1: FIFO Src addressing within an array wraps around upon reaching FIFO width." range="0" rwaccess="RW"/>
	</register>
	<register id="TPTC00_SASRC" acronym="TPTC00_SASRC" offset="0x244" width="32" description="">
		<bitfield id="SADDR" width="32" begin="31" end="0" resetval="0x0" description="Source address for Source Active Register Set" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="TPTC00_SACNT" acronym="TPTC00_SACNT" offset="0x248" width="24" description="">
		<bitfield id="ACNT" width="23" begin="22" end="0" resetval="0x0" description="A-Dimension count. Number of bytes to be transferred in first dimension." range="22 - 0" rwaccess="RO"/>
	</register>
	<register id="TPTC00_SADST" acronym="TPTC00_SADST" offset="0x24C" width="32" description="">
		<bitfield id="DADDR" width="32" begin="31" end="0" resetval="0x0" description="Destination address for Source Active Register Set" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="TPTC00_SABIDX" acronym="TPTC00_SABIDX" offset="0x250" width="32" description="">
		<bitfield id="DBIDX" width="16" begin="31" end="16" resetval="0x0" description="Dest B-Idx for Source Active Register Set:B-Idx offset between Destination arrays: Represents the offset in bytes between the starting address of each destination array [recall that there are BCNT arrays of ACNT elements]. DBIDX is always used regardless of whether DAM is Increment or FIFO mode." range="31 - 16" rwaccess="RO"/> 
		<bitfield id="SBIDX" width="16" begin="15" end="0" resetval="0x0" description="Source B-Idx for Source Active Register Set:B-Idx offset between Source arrays: Represents the offset in bytes between the starting address of each source array [recall that there are BCNT arrays of ACNT elements]. SBIDX is always used regardless of whether SAM is Increment or FIFO mode." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="TPTC00_SAMPPRXY" acronym="TPTC00_SAMPPRXY" offset="0x254" width="16" description="">
		<bitfield id="SECURE" width="1" begin="9" end="9" resetval="0x0" description="Secure Level: Deprecated, always read as 0." range="9" rwaccess="RO"/> 
		<bitfield id="PRIV" width="1" begin="8" end="8" resetval="0x0" description="Privilege Level:PRIV = 0 : User level privilegePRIV = 1 : Supervisor level privilegePMPPRXY.PRIV is always updated with the value from the configuration bus privilege field on any/every write to Program Set BIDX Register [trigger register].The PRIV value for the SA Set and DF Set are copied from the value in the Program set along with the remainder of the parameter values.The privilege ID is issued on the VBusM read and write command bus such that the target endpoints can perform memory protection checks based on the PRIV of the external host that sets up the DMA transaction." range="8" rwaccess="RO"/> 
		<bitfield id="PRIVID" width="4" begin="3" end="0" resetval="0x0" description="Privilege ID:PMPPRXY.PRIVID is always updated with the value from configuration bus privilege ID field on any/every write to Program Set BIDX Register [trigger register].The PRIVID value for the SA Set and DF Set are copied from the value in the Program set along with the remainder of the parameter values.The privilege ID is issued on the VBusM read and write command bus such that the target endpoints can perform memory protection checks based on the privid of the external host that sets up the DMA transaction." range="3 - 0" rwaccess="RO"/>
	</register>
	<register id="TPTC00_SACNTRLD" acronym="TPTC00_SACNTRLD" offset="0x258" width="16" description="">
		<bitfield id="ACNTRLD" width="16" begin="15" end="0" resetval="0x0" description="A-Cnt Reload value for Source Active Register set. Value copied from PCNT.ACNT: Represents the originally programmed value of ACNT.The Reload value is used to reinitialize ACNT after each array is serviced [i.e. ACNT decrements to 0]. by the Src offset in bytes between the starting address of each source array [recall that there are BCNT arrays of ACNT bytes]" range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="TPTC00_SASRCBREF" acronym="TPTC00_SASRCBREF" offset="0x25C" width="32" description="">
		<bitfield id="SADDRBREF" width="32" begin="31" end="0" resetval="0x0" description="Source address reference for Source Active Register Set:Represents the starting address for the array currently being read. The next array's starting address is calculated as the 'reference address' plus the 'source b-idx' value." range="31 - 0" rwaccess="RO"/>
	</register>
