IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/TPTC00_TPTC00.xml
	<register id="TPTC00_DFBCNT0" acronym="TPTC00_DFBCNT0" offset="0x318" width="16" description="">
		<bitfield id="BCNT" width="16" begin="15" end="0" resetval="0x0" description="B-Count Remaining for Dst Register Set:Number of arrays to be transferred where each array is ACNT in length.Represents the amount of data remaining to be written.Initial value is copied from PCNT.TC decrements ACNT and BCNT as necessary after each write dataphase is issued. Final value should be 0 when TR is complete." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="TPTC00_DFOPT1" acronym="TPTC00_DFOPT1" offset="0x340" width="32" description="">
		<bitfield id="DBG_ID" width="2" begin="29" end="28" resetval="0x0" description="Debug IDValue driven on the read (tptc_r_dbg_channel_id) and write (tptc_w_dbg_channel_id) command bus.Used at system level for trace/profiling of user selected transfers in systems that include this feature." range="29 - 28" rwaccess="RW"/> 
		<bitfield id="TCCHEN" width="1" begin="22" end="22" resetval="0x0" description="Transfer complete chaining enable:0: Transfer complete chaining is disabled.1: Transfer complete chaining is enabled." range="22" rwaccess="RW"/> 
		<bitfield id="TCINTEN" width="1" begin="20" end="20" resetval="0x0" description="Transfer complete interrupt enable:0: Transfer complete interrupt is disabled.1: Transfer complete interrupt is enabled." range="20" rwaccess="RW"/> 
		<bitfield id="TCC" width="6" begin="17" end="12" resetval="0x0" description="Transfer Complete Code: The 6-bit code is used to set the relevant bit in CER or IPR of the TPCC module." range="17 - 12" rwaccess="RW"/> 
		<bitfield id="FWID" width="3" begin="10" end="8" resetval="0x0" description="FIFO width control: Applies if either SAM or DAM is set to FIFO mode." range="10 - 8" rwaccess="RW"/> 
		<bitfield id="PRI" width="3" begin="6" end="4" resetval="0x0" description="Transfer Priority:0: Priority 0 - Highest priority1: Priority 1 ...7: Priority 7 - Lowest priority" range="6 - 4" rwaccess="RW"/> 
		<bitfield id="DAM" width="1" begin="1" end="1" resetval="0x0" description="Destination Address Mode within an array:0: INCR Dst addressing within an array increments.1: FIFO Dst addressing within an array wraps around upon reaching FIFO width." range="1" rwaccess="RW"/> 
		<bitfield id="SAM" width="1" begin="0" end="0" resetval="0x0" description="Source Address Mode within an array:0: INCR Src addressing within an array increments.1: FIFO Src addressing within an array wraps around upon reaching FIFO width." range="0" rwaccess="RW"/>
	</register>
	<register id="TPTC00_DFSRC1" acronym="TPTC00_DFSRC1" offset="0x344" width="32" description="">
		<bitfield id="SADDR" width="32" begin="31" end="0" resetval="0x0" description="Source address is not applicable for Dst FIFO Register Set: Reads return 0x0." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="TPTC00_DFACNT1" acronym="TPTC00_DFACNT1" offset="0x348" width="24" description="">
		<bitfield id="ACNT" width="23" begin="22" end="0" resetval="0x0" description="A-Dimension count. Number of bytes to be transferred infirst dimension." range="22 - 0" rwaccess="RO"/>
	</register>
	<register id="TPTC00_DFDST1" acronym="TPTC00_DFDST1" offset="0x34C" width="32" description="">
		<bitfield id="DADDR" width="32" begin="31" end="0" resetval="0x0" description="Destination address for Dst FIFO Register Set:Initial value is copied from PDST.DADDR.TC updates value according to destination addressing mode [OPT.SAM] and/or dest index value [BIDX.DBIDX] after each write command is issued.When a TR is complete the final value should be the address of the last write command issued." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="TPTC00_DFBIDX1" acronym="TPTC00_DFBIDX1" offset="0x350" width="32" description="">
		<bitfield id="DBIDX" width="16" begin="31" end="16" resetval="0x0" description="Dest B-Idx for Dest FIFO Register Set.Value copied from PBIDX: B-Idx offset between Destination arrays: Represents the offset in bytes between the starting address of each destination array [recall that there are BCNT arrays of ACNT elements].DBIDX is always used regardless of whether DAM is Increment or FIFO mode." range="31 - 16" rwaccess="RO"/> 
		<bitfield id="SBIDX" width="16" begin="15" end="0" resetval="0x0" description="Src B-Idx for Dest FIFO Register Set.Value copied from PBIDX: B-Idx offset between Source arrays: Represents the offset in bytes between the starting address of each source array [recall that there are BCNT arrays of ACNT elements].SBIDX is always used regardless of whether SAM is Increment or FIFO mode." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="TPTC00_DFMPPRXY1" acronym="TPTC00_DFMPPRXY1" offset="0x354" width="16" description="">
		<bitfield id="SECURE" width="1" begin="9" end="9" resetval="0x0" description="Secure Level: Deprecated, always read as 0." range="9" rwaccess="RO"/> 
		<bitfield id="PRIV" width="1" begin="8" end="8" resetval="0x0" description="Privilege Level:PRIV = 0 : User level privilegePRIV = 1 : Supervisor level privilegePMPPRXY.PRIV is always updated with the value from the configuration bus privilege field on any/every write to Program Set BIDX Register [trigger register].The PRIV value for the SA Set and DF Set are copied from the value in the Program set along with the remainder of the parameter values.The privilege ID is issued on the VBusM read and write command bus such that the target endpoints can perform memory protection checks based on the PRIV of the external host that sets up the DMA transaction." range="8" rwaccess="RO"/> 
		<bitfield id="PRIVID" width="4" begin="3" end="0" resetval="0x0" description="Privilege ID:PMPPRXY.PRIVID is always updated with the value from configuration bus privilege ID field on any/every write to Program Set BIDX Register [trigger register].The PRIVID value for the SA Set and DF Set are copied from the value in the Program set along with the remainder of the parameter values.The privilege ID is issued on the VBusM read and write command bus such that the target endpoints can perform memory protection checks based on the privid of the external host that sets up the DMA transaction." range="3 - 0" rwaccess="RO"/>
	</register>
	<register id="TPTC00_DFBCNT1" acronym="TPTC00_DFBCNT1" offset="0x358" width="16" description="">
		<bitfield id="BCNT" width="16" begin="15" end="0" resetval="0x0" description="B-Count Remaining for Dst Register Set:Number of arrays to be transferred where each array is ACNT in length.Represents the amount of data remaining to be written.Initial value is copied from PCNT.TC decrements ACNT and BCNT as necessary after each write dataphase is issued. Final value should be 0 when TR is complete." range="15 - 0" rwaccess="RO"/>
	</register>
</module>